<?php

$states = array('шт. Калифорния' => ['Лос-Анджелес' => 3792621, 'Сан-Диего' => 1307402,'Сан-Хосе' => 945942],
    'шт. Техас' => ['Хьюстон' => 2100263, 'Сан-Антонио' => 1327407, 'Даллас' => 1197816],
    'Нью-Йорк' => [8175133],
    'шт. Иллинойс' => ['Чикаго', 2695598],
    'шт. Пенсильвания' => ['Филадельфия', 1526006],
    'шт. Аризона' => ['Феникс', 1445632]);

print('<table>' . "\n");
foreach ($states as $state => $cities) {
    if (count($cities)>1){

    } else {
        print ("<tr><td>$city</td><td>$count</td></tr>\n");
    }

    $count_people += $count;
}
print("<tr><td>ALL</td><td>$count_people</td></tr>\n");
print('</table>');